# InSessionViewSheetSet Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InSessionViewSheetSet Properties
InSessionViewSheetSet Class See Also
---
The InSessionViewSheetSet type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsAutomatic | Automatic order or manual order. |
| OrderedViewList | Ordered views. |
| SheetOrganizationId | ElementId to the BrowserOrganization for sheets. |
| ViewOrganizationId | ElementId to the BrowserOrganization for non-sheet views. |
| Views | The views. |

# See Also
InSessionViewSheetSet Class
Autodesk.Revit.DB Namespace